[
    {
        "title": "Data Scientist",
        "company": "Maruti Suzuki India Ltd",
        "location": "Gurugram, Haryana",
        "salary": null,
        "description": "Educational Qualification:\n\nEssential: B.E. / B.Tech/ M. Tech./M.Sc. in any stream\n\nDesirable: Specialization in data science or statistics\n\nRole\n\n: Data Scientist\n\nResponsibilities:\n\n• Data Solutions Architecture: Develop innovative data-driven solutions for business challenges using Telematics data. Collaborate with domain experts to gain automotive insights.\n\n• IoT Device Mastery: Understand the Telematics Control Unit (TCU) and the time-series data it generates.\n\n• Data Landscape Analysis: Evaluate data adequacy and establish a comprehensive understanding of the data landscape.\n\n• Data Preparation: Clean and prepare datasets for modeling. Engage in ETL processes and apply data transformation techniques such as resampling, filtering, and encoding.\n\n• Exploratory Data Analysis: Conduct exploratory data analysis to derive insights. Present descriptive statistics and insights to domain experts. Identify meaningful patterns, detect seasonality and trends, and establish cause-and-effect relationships.\n\n• Feature Engineering: Design and select features, study feature importance, and decide on the machine learning strategy.\n\n• Model Development: Select appropriate machine learning/deep learning models, set up data pipelines for model training, perform hyper-parameter tuning, validation, and testing. Apply ensemble modeling techniques if required.\n\n• Reporting & Visualization: Create comprehensive reports and visualize data using plots and heat maps. Utilize tools like Google Maps API for visualization.\n\nTechnical Skills / Experience:\n\nEssential\n\n:\n\n• Industry Experience: Minimum of 5 years in a data scientist role.\n\n• Machine Learning Expertise: Experience with machine learning algorithms (e.g., Generalized Linear Models, Boosting, Decision Trees, Neural Networks, SVM, Bayesian Methods, time series models).\n\n• Hands-on Experience: Proficiency in using machine learning models for regression, classification, and unsupervised learning algorithms. Knowledge of clustering techniques.\n\n• Cloud Computing: Experience with cloud platforms such as AWS, Azure, or Google Cloud Platform.\n\n• Programming Skills: Strong programming skills in Python, with experience using libraries like pandas, numpy, matplotlib, and sklearn.\n\n• Data Visualization: Proficiency in data visualization techniques and tools.\n\nDesirable\n\n:\n\n• Databricks Platform: Experience with Databricks for big data processing and machine learning.\n\n• Distributed Computing: Experience with Spark or other distributed computing frameworks.\n\n• AutoML Tools: Understanding of tools like AWS Sagemaker, Google AutoML, IBM AutoAI, and Databricks.\n\n• Telematics Data Analytics: Experience in time-series/IoT data analytics, including data streaming from vehicle on-board IoT devices.\n\n• Automotive Systems Knowledge: Exposure to automotive systems, basics of automobiles, and Controller Area Network (CAN) protocol.\n\n• Remote Collaboration: Experience working with remote team members.\n\n• Advanced Visualization Tools: Experience with data visualization tools such as Tableau and PowerBI.\n\n• Google Maps API: Working experience with Google Maps API for creating heat maps\n\nBehavioral:\n\n• Analytical Thinking: Strong analytical skills to interpret complex data and derive actionable insights.\n\n• Problem-Solving: Ability to approach problems creatively and develop innovative solutions.\n\n• Attention to Detail: Meticulous attention to detail to ensure data accuracy and model reliability.\n\n• Communication: Excellent communication skills to convey technical information to non-technical stakeholders.\n\n• Collaboration: Strong team player with the ability to work collaboratively in a cross-functional environment.\n\n• Adaptability: Flexibility to adapt to changing business needs and evolving technologies.\n\n• Curiosity: A proactive learner with a curiosity to explore new technologies and methodologies.\n\n• Time Management: Effective time management skills to handle multiple projects and meet deadlines",
        "posted_date": "2025-02-12T07:11:11.000Z",
        "job_url": "https://maruti.app.param.ai/jobs/data-scientist-019/"
    },
    {
        "title": "Software Engineer",
        "company": "RELX",
        "location": "Gurugram, Haryana",
        "salary": null,
        "description": "BASIC FUNCTIONS: This position performs moderately difficult research, design, and software development assignments within a specific software functional area or product line. The position should have the ability to work on individual pieces of work and solve problems including the design of the program flow of individual pieces of code, effective coding, and unit testing.\n\nQUALIFICATIONS:\n• 3+ years of Software Engineering experience\n• BS Engineering/Computer Science or equivalent experience required\n\nTECHNICAL SKILLS:\n• Proficiency with data manipulation languages.\n• Understanding of data modeling principles.\n• Ability to work with complex data models.\n• Proficiency in development languages including but not limited to: XPP, XML, XQuery\n• Familiarity of industry best practices — code coverage.\n• Ability to work well with internal and external technology resources.\n• Ability to write and review portions of detailed specifications for the development of system components of moderate complexity.\n• Knowledge of software development methodologies (e.g., Agile, Waterfall).\n• Knowledge of data manipulation languages.\n• Knowledge of data storage subsystems.\n• Knowledge of test-driven development.\n• Ability to write and review portions of detailed specifications for the development of system components of moderate complexity.\n• Ability to complete moderately complex bug fixes.\n• Good oral and written communications skills.\n\nACCOUNTABILITIES:\n• Interface with other technical personnel or team members to finalize requirements.\n• Write and review portions of detailed specifications for the development of system components of moderate complexity.\n• Work closely with other development team members to understand moderately complex product requirements and translate them into software designs.\n• Successfully implement development processes, coding best practices, and code reviews.\n• Operate in various development environments (Agile, Waterfall, etc.) while collaborating with key stakeholders.\n• Resolve technical issues as necessary.\n• Keep abreast of new technology developments.\n• Complete bug fixes.\n• All other duties as assigned.\n\nLexisNexis, a division of RELX, is an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. We are committed to providing a fair and accessible hiring process. If you have a disability or other need that requires accommodation or adjustment, please let us know by completing our Applicant Request Support Form: https://forms.office.com/r/eVgFxjLmAK , or please contact 1-855-833-5120.\n\nPlease read our Candidate Privacy Policy.",
        "posted_date": "2025-02-12T08:11:03.000Z",
        "job_url": "https://relx.wd3.myworkdayjobs.com/en-US/relx/job/Gurgaon/Software-Engineer_R90857-1"
    },
    {
        "title": "Business Intelligence Engineer, RBS ARTS",
        "company": "ADCI MAA 15 SEZ",
        "location": "Chennai, Tamil Nadu",
        "salary": null,
        "description": "- 3+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\n- Experience with data visualization using Tableau, Quicksight, or similar tools\n- Experience with data modeling, warehousing and building ETL pipelines\n- Experience in Statistical Analysis packages such as R, SAS and Matlab\n- Experience using SQL to pull data from a database or data warehouse and scripting experience (Python) to process data for modeling\n\nAbout Amazon.com:\n Amazon.com strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon.com continues to grow and evolve as a world-class e-commerce platform. Amazon's evolution from Web site to e-commerce partner to development platform is driven by the spirit of innovation that is part of the company's DNA. The world's brightest technology minds come to Amazon.com to research and develop technology that improves the lives of shoppers and sellers around the world.\n\nAbout Team\n The RBS team is an integral part of Amazon online product lifecycle and buying operations. The team is designed to ensure Amazon remains competitive in the online retail space with the best price, wide selection and good product information. The team’s primary role is to create and enhance retail selection on the worldwide Amazon online catalog. The tasks handled by this group have a direct impact on customer buying decisions and online user experience.\n\nOverview of the role:\n An candidate will be a self-starter who is passionate about discovering and solving complicated problems, learning complex systems, working with numbers, and organizing and communicating data and reports. You will be detail-oriented and organized, capable of handling multiple projects at once, and capable of dealing with ambiguity and rapidly changing priorities. You will have expertise in process optimizations and systems thinking and will be required to engage directly with multiple internal teams to drive business projects/automation for the RBS team. Candidates must be successful both as individual contributors and in a team environment, and must be customer-centric. Our environment is fast-paced and requires someone who is flexible, detail-oriented, and comfortable working in a deadline-driven work environment. Responsibilities Include Works across team(s) and Ops organization at country, regional and/or cross regional level to drive improvements and enables to implement solutions for customer, cost savings in process workflow, systems configuration and performance metrics.\n\nBasic Qualifications\n• Bachelor's degree in Computer Science, Information Technology, or a related field\n• Proficiency in automation using Python\n• Excellent oral and written communication skills\n• Experience with SQL, ETL processes, or data transformation\n\nPreferred Qualifications\n• Experience with scripting and automation tools \n• Familiarity with Infrastructure as Code (IaC) tools such as AWS CDK\n• Knowledge of AWS services such as SQS, SNS, CloudWatch and DynamoDB\n• Understanding of DevOps practices, including CI/CD pipelines and monitoring solutions\n• Understanding of cloud services, serverless architecture, and systems integration\n\nKey job responsibilities\nAs a Business Intelligence Engineer in the team, you will collaborate closely with business partners, architect, design, implement, and BI projects & Automations.\nto build scalable data solutions and analytical insight. \nYou will work with a team of highly motivated business intelligence engineers, Business Analysts and\n\n- Contribute to the design, implementation, and delivery of complex BI solutions \n- Adopt best practices in reporting and analysis: data integrity, test design, analysis, validation, and documentation.\nBasic qualifications\n- Develop innovative BI and data analytics solutions leveraging advanced machine learning models to solve complex problems, build intelligent knowledge bases, and create conversational interfaces for enhanced business insights and recommendations.- Drive projects on data automation, governance and standardisation\n\n• 5+ years of relevant professional experience in business intelligence, analytics, statistics, data engineering, data science or related field.\n• Experience with programming languages packages such as Python, TypeScript or R.\n• Experience with Data modeling, SQL, ETL, Data Warehousing and Data Lakes.\n• Strong experience with engineering and operations best practices (version control, data quality/testing, monitoring, etc.)\n• Expert-level SQL.\n• Proficiency with one or more general purpose programming languages (e.g. Python, Java, Typescript, Scala, etc.)\n• Knowledge of AWS products such as Redshift, Quicksight, and Lambda.\n• Excellent verbal/written communication & data presentation skills, including ability to succinctly summarize key findings and effectively communicate with both business and technical teams.\n\nPreferred qualifications\n\n• Familiarity with Infrastructure as Code (IaC) tools such as AWS CDK \n• Experience with AWS solutions such as Step-Functions, EC2, DynamoDB, S3.\n• Knowledge of machine learning techniques and concepts.\n• Understanding of cloud services, serverless architecture, and systems integration\n• Strong understanding of machine learning concepts, including the development and deployment of ML models to solve complex problems.\n\n- Experience with AWS solutions such as EC2, DynamoDB, S3, and Redshift\n- Experience in data mining, ETL, etc. and using databases in a business environment with large-scale, complex datasets\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
        "posted_date": "2025-02-12T07:53:44.000Z",
        "job_url": "https://www.amazon.jobs/en/jobs/2899172/business-intelligence-engineer-rbs-arts?cmpid=DA_INAD200785B"
    },
    {
        "title": "Frontend Developer",
        "company": "Hero Moto Corp",
        "location": "Jaipur, Rajasthan",
        "salary": null,
        "description": "»\n\nDate: 12 Feb 2025\n\nLocation: Jaipur, RJ, IN, 302028\n\nCompany: Hero Motocorp\n\nFunction\n\nResearch & Development - Jaipur\n\nPay Band\n\nE4 to M2\n\nRole\n\nFrontend Developer\n\nA purpose driven role for you\n\no Design and develop scalable, efficient, and well-tested software solutions\no Implement best practices in software development life cycle (SDLC) and maintain high code\nquality standards\no Develop and maintain responsive, user-friendly web applications using modern frontend\ntechnologies (React, Angular, Vue.js, or similar).\no Implement interactive features and dynamic UI elements using JavaScript, HTML, and CSS.\no Focus on: Frontend system design for AI ML, Blockchain, Cloud preferably aws, Quantum\nsolutions and to work domains like Battery management system, Motor control unit, Vehicle\ncontrol unit, Telematics (Bluetooth, GSM, GPS, Wi-Fi, etc.), Cloud infrastructure, in house\ndiagnostic/flashing tool GUI development Implement security and data protection measures.\no Optimize application performance and responsiveness.\no Ensure cross-browser compatibility and accessibility.\no Stay up-to-date with emerging technologies, tools, and best practices in web and front end\ndevelopment.\no Collaborate with product owners to translate user needs and business requirements into\nintuitive user interfaces.\no Create wireframes, mockups, and prototypes to visualize and iterate on design solutions.\no Use Figma to design and collaborate on UI/UX designs\no Ensure UI consistency and adherence to brand guidelines.\n\nA Day in the life\n\nFrontend Development\n• Strong proficiency in JavaScript (ES6+), HTML, and CSS\n• Implement frontend features using popular frameworks/libraries such as React, Angular, or Vue.js\n• Develop reusable and modular React components, using React Hooks and Redux\n• Experience with python for in house tool development like diagnostic/flashing tool\n• Work with React Router to create clientside routing and navigation\n• Create responsive and accessible UI components using CSS frameworks like Bootstrap or Material-UI\n• Develop and maintain responsive web designs that provide an optimal user experience across various devices and screen sizes.\n• Knowledge of desktop and mobile app development is must\n• Use JavaScript libraries like jQuery or Lodash to improve code readability and maintainability\n• Create and edit designs, prototypes, and high-fidelity designs using Figma\n• Experience with testing frameworks like Jest and Pytest\n\nAcademic Qualification & Experience\n\nBE/B-Tech or M-Tech in technical course of studies.\n\nAdvanced Qualifications are an advantage.\n\nTechnical Skills/Knowledge\n\no Proficiency in HTML, CSS, JavaScript, Python, React, Redux, Node.js, and Express.js\no Experience with Figma, Sketch, or Adobe XD\no Solid understanding of software engineering principles, design patterns, data structures, and algorithms. Prior experience in system architecture is highly desirable\no Experience with Snowflake and data engineering to work with AI ML team\no Understanding of Linux and embedded systems\no Experience in cloud computing, preferably AWS. Knowledge of Docker, Docker Compose, and Kubernetes is a plus\no Knowledge of Cloud & NoSQL databases\no Experience in software testing(both manual and automation) and writing test cases.\no Collaborate with DevOps teams to deploy and manage applications in cloud environments (AWS, GCP, Azure, etc.).\no Ability to communicate effectively with designers, developers, and stakeholders\no Exposure to Machine Learning concepts\no Proficiency with Git and CI/CD pipelines\no Experience with authentication and authorization mechanisms\no Strong communication and collaboration abilities\no Strong sense of achievement and ownership\no Stay abreast of industry trends and introduce appropriate technologies and tools\n\nBehavioural Skills\n\no Strong communication and collaboration abilities\no Strong sense of achievement and ownership\n\nWhat will it be like to work for Hero\n\nAs the world’s largest manufacturer of motorcycles and scooters for the last 22 years, Hero is where you will get to work with the brightest innovators, passionate about being the best in what they do. You will become a part of India’s proudest legacy, a brand that is celebrated by 110 million Indians and is now taking over the world with its manufacturing superpower. If you are someone who dreams big and goes after their dreams with absolute conviction, Hero is your place to be. At Hero, we are building a cutting-edge future of mobility, pushing frontiers of innovation and aiming for the very best. Choose to be with the best, choose to be your best.\n\nAbout Hero\n\nHeadquartered in New Delhi (India), Hero MotoCorp is the world's largest manufacturer of motorcycles and scooters for 22 consecutive years. We are at the forefront of developing modern, technologically superior and eco-friendly mobility solutions for its millions of customers around the world.\n\nHero MotoCorp has rapidly transformed into a true multinational organization with a presence in 47 countries across Asia, Africa, Latin America and the Middle East.\n\nWe have achieved the coveted milestone of 110 million cumulative production and sales since inception. Aligned with its Vision “Be the Future of Mobility”, Hero MotoCorp plans to achieve its next 100 million sales by 2030.\n\nWe have a globally benchmarked manufacturing and Research & Development (R&D) ecosystem that is spread across global geographies. Its R&D facilities are located in India and Germany - the Centre of Innovation and Technology (CIT) at Jaipur, India, and the Tech Centre Germany (TCG), near Munich. Hero MotoCorp’s eight ‘green’ manufacturing facilities are spread across India (6), Colombia (1) and Bangladesh (1).\n\nHero MotoCorp is the pre-eminent leader in the Indian two-wheeler market. It is the only motorcycle manufacturing company listed in Dow Jones Sustainability Index.\n\nIn 2022, Hero MotoCorp launched a separate brand for emerging mobility solutions, including Electric Vehicles (EV) - VIDA, Powered by Hero. VIDA has commenced sales of VIDA V1 – its first EV – in India and plans to launch the product in global markets.\n\nWe are one of the largest global corporate promoters of multiple sporting disciplines. Hero is globally associated with golf, football, field hockey, cricket and motorsports. Hero MotoSports Team Rally is one of India’s flag-bearers in global rally racing. The iconic golfer Tiger Woods is Hero MotoCorp’s Global Corporate Partner.\n\nRead more about us.\nBe with the best. Be your best. Catch-up on all our latest openings.\nRecruitment assessments – We at Hero are equal opportunity employer and committed to a policy of treating all its employees and job applications equally. Some of our roles use assessments to help us understand how suitable you are for the role you've applied to. If you are invited to take an assessment, this is great news. It means your application has progressed to an important stage of our recruitment process.\n\nJob Details- For internal use only\n\nJob Segment: R&D Engineer, R&D, Cloud, Test Engineer, Testing, Engineering, Research, Technology\n\n »",
        "posted_date": "2025-02-12T06:07:50.000Z",
        "job_url": "https://jobs.heromotocorp.com/job/Jaipur-Frontend-Developer-RJ-302028/1170747301/"
    },
    {
        "title": "IN_Associate_ETL Data Engineer _D&A _Advisory _Mumbai",
        "company": "PwC",
        "location": "Shivaji Park, Mumbai, Maharashtra",
        "salary": null,
        "description": "Line of Service\n\nAdvisory\n\nIndustry/Sector\n\nNot Applicable\n\nSpecialism\n\nData, Analytics & AI\n\nManagement Level\n\nAssociate\n\nJob Description & Summary\n\nAt PwC, our people in data and analytics focus on leveraging data to drive insights and make informed business decisions. They utilise advanced analytics techniques to help clients optimise their operations and achieve their strategic goals.\n\nIn business intelligence at PwC, you will focus on leveraging data and analytics to provide strategic insights and drive informed decision-making for clients. You will develop and implement innovative solutions to optimise business performance and enhance competitive advantage.\n\n*Why PWC\n\nAt PwC, you will be part of a vibrant community of solvers that leads with trust and creates distinctive outcomes for our clients and communities. This purpose-led and values-driven work, powered by technology in an environment that drives innovation, will enable you to make a tangible impact in the real world. We reward your contributions, support your wellbeing, and offer inclusive benefits, flexibility programmes and mentorship that will help you thrive in work and life. Together, we grow, learn, care, collaborate, and create a future of infinite experiences for each other. Learn more about us .\n\nAt PwC, we believe in providing equal employment opportunities, without any discrimination on the grounds of gender, ethnic background, age, disability, marital status, sexual orientation, pregnancy, gender identity or expression, religion or other beliefs, perceived differences and status protected by law. We strive to create an environment where each one of our people can bring their true selves and contribute to their personal growth and the firm’s growth. To enable this, we have zero tolerance for any discrimination and harassment based on the above considerations. \"\n\nResponsibilities:\n\n· Minimum 3 years of professional experience with working knowledge in a Data and Analytics role with a Global organization\n\n· Mandatory Hands-on Development Experience in ETL tool : Informatica Power center OR IICS\n\n· Should have implemented end to end ETL life cycle, preparing ETL design frameworks and execution\n\n· Must have rich experience building Operational Data stores, Data marts and Enterprise Data warehouse\n\n· Must have very good SQL skills ( Specifically in Oracle, MySQL)\n\n· Should be able to create and execute ETL designs and test cases should be able to write complex SQL queries for testing/analysis depending upon the functional/technical requirement.\n\n· Should have worked on performance optimization, error handling, writing stored procedures, etc.\n\n· Demonstrate ability to communicate effectively with both Technical & Business stakeholders\n\n· Should have Understanding of data modelling, Data warehousing concepts\n\nMandatory skill sets:\n\n- ETL Developer\n\nPreferred skill sets:\n\n- ETL Developer\n\nYears of experience required:\n\n2+\n\nEducation qualification:\n\nBE/BTech/MBA/MCA\n\nEducation (if blank, degree and/or field of study not specified)\n\nDegrees/Field of Study required: Master of Business Administration, Bachelor of Engineering\n\nDegrees/Field of Study preferred:\n\nCertifications (if blank, certifications not specified)\n\nRequired Skills\n\nETL (Informatica)\n\nOptional Skills\n\nAccepting Feedback, Accepting Feedback, Active Listening, Business Case Development, Business Data Analytics, Business Intelligence and Reporting Tools (BIRT), Business Intelligence Development Studio, Communication, Competitive Advantage, Continuous Process Improvement, Data Analysis and Interpretation, Data Architecture, Database Management System (DBMS), Data Collection, Data Pipeline, Data Quality, Data Science, Data Visualization, Emotional Regulation, Empathy, Inclusion, Industry Trend Analysis, Intellectual Curiosity, Java (Programming Language), Market Development {+ 7 more}\n\nDesired Languages (If blank, desired languages not specified)\n\nTravel Requirements\n\nNot Specified\n\nAvailable for Work Visa Sponsorship?\n\nNo\n\nGovernment Clearance Required?\n\nNo",
        "posted_date": "2025-02-12T07:10:43.000Z",
        "job_url": "https://pwc.wd3.myworkdayjobs.com/en-US/Global_Experienced_Careers/job/Mumbai-Shivaji-Park/IN-Associate-ETL-Data-Engineer--D-A--Advisory--Mumbai_604569WD-1"
    },
    {
        "title": "Business Process Analyst",
        "company": "Rockwell Automation",
        "location": "Delhi, Delhi",
        "salary": null,
        "description": "Rockwell Automation is a global technology leader focused on helping the world’s manufacturers be more productive, sustainable, and agile. With more than 28,000 employees who make the world better every day, we know we have something special. Behind our customers - amazing companies that help feed the world, provide life-saving medicine on a global scale, and focus on clean water and green mobility - our people are energized problem solvers that take pride in how the work we do changes the world for the better.\n\nWe welcome all makers, forward thinkers, and problem solvers who are looking for a place to do their best work. And if that’s you we would love to have you join us!\n\nJob Description\n\n· Promote, guide and lead transformation teams in the implementation of the Lean methods, which includes the use of various process improvement tools including, but not limited to: Value Stream Mapping, Kaizen, 5S, Standard Work, Root Cause Analysis, PFMEA, Control Charts.\n\n· Lead cross functional teams to implement and leverage best practices across Lifecycle Services to ensure process improvements are institutionalized throughout the business.\n\n· Positively lead teams and organizations through change. Communicate effectively to teams and leadership to ensure support for resources and buy-in for change.\n\n· Facilitate kaizen events, track progress, and assure appropriate strategic deployment metrics and key process indicators are in place and being utilized by business to enable sustainable gain.\n\n· Collaborate with business leadership teams to develop annual plans in support of continuous improvement to drive improvements in key metrics.\n\n· Communicate to leadership teams on global initiatives, continuous improvement projects, kaizen status on a regular basis.\n\n· Continuously identify opportunities, scope projects and track benefits to achieve productivity, quality and service improvement targets aligned with business priorities, financial improvements, and customer experience.\n\n· Be a change leader and progress continuous improvement mindset throughout Lifecycle Services.\n\n· Be able to evaluate new technologies to advance deliverables.\n\n· Stay current with technologies and Lean concepts through continuing education and benchmarking.\n\n· Provide training, coaching, and mentoring of Lean/Six Sigma principles, concepts, behaviors and tools that enhance the existing culture to one of continuous improvement at all levels of the organization which includes training and mentoring others to become Lean/Six Sigma practitioners\n\n· As requested, and as value can be provided, participate in LFS and CI core team initiatives to help them achieve their vision of ‘developing and enabling CI resources globally to spread the adoption of competencies and capabilities, to increase value, and to align to the wants and needs of our customers.’\n\n· All other special projects and tasks as assigned.\n\nRockwell Automation’s hybrid policy aligns that employees are expected to work at a Rockwell location at least Mondays, Tuesdays, and Thursdays unless they have a business obligation out of the office.",
        "posted_date": "2025-02-12T03:43:53.000Z",
        "job_url": "https://rockwellautomation.wd1.myworkdayjobs.com/en-US/External_Rockwell_Automation/job/India-New-Delhi-Noida/Business-Process-Analyst_R25-23?codes=IND"
    },
    {
        "title": "Data Management - Business Analyst",
        "company": "State Street",
        "location": "Bengaluru, Karnataka",
        "salary": null,
        "description": "Role Summary & Role Description:\n\nChief Data Office (CDO) - Global Technology Solutions at State Street has a mandate to govern and report on data health across the enterprise. CDO is rolling out multiple initiatives and operating model changes to execute these initiatives and generate value for our internal and external clients.\n\nWe are looking for qualified candidates with experience primarily focused on Master Data Management use cases, while delivering source data analysis and storyboards to various stakeholders\n\nWork you’ll do:\n\nWork closely with Business Analysts to understand the requirements and perform data profiling, analysis and recommendation for next steps.\nWork with various stakeholder groups on Master Data Management use cases like source data processing, data analysis, incident analysis.\nSample/export data from multiple source systems on different technical platforms(via SQL queries)\nDevelop user stories, business and data procedures, source to target mappings, DQ rules and related documentation for the data products being developed.\nProactively collaborate with Business stakeholder, IT/data engineering team members, business users and implementation team along the project lifecycle, understanding the impacts that may have on downstream use cases.\n\nCore/Must have skills\n\nData Analysis and profiling from various internal and external data sources\nExperience in Data Transformation requirements from variety of sources\nData querying / SQL experience for sample data collections and analysis\nHands on experience with Python programming for data processing\nHands on experience with PowerBI or Tableau visualization tools\nAgile SDLC processes for manage and deliver requirements across sprints and releases\nExperience in translating business requirement to user stories for development\nWorking knowledge on Jira or similar tools\nExcellent communication, articulation and stakeholder management skills\n\nGood to have\n\nGood to have Visio or other design tools to prepare flow diagrams.\nAnalyze a variety of data sources/formats, document required transformations and controls on the data elements to be fit for analytical data lake house\nDefine and govern data modeling and design standards, tools, best practices, and related development for enterprise data models.\nExposure to Databricks / AWS project experience / ETL tools / projects\n\nWork Schedule: Hybrid\n\nWhy this role is important to us:\n\nOur technology function, Global Technology Services (GTS), is vital to State Street and is the key enabler for our business to deliver data and insights to our clients. We’re driving the company’s digital transformation and expanding business capabilities using industry best practices and advanced technologies such as cloud, artificial intelligence and robotics process automation.\n\nWe offer a collaborative environment where technology skills and innovation are valued in a global organization. We’re looking for top technical talent to join our team and deliver creative technology solutions that help us become an end-to-end, next-generation financial services company.\n\nJoin us if you want to grow your technical skills, solve real problems and make your mark on our industry.\n\nState Street's Speak Up Line",
        "posted_date": "2025-02-12T07:20:45.000Z",
        "job_url": "https://statestreet.wd1.myworkdayjobs.com/en-US/Global/job/Bangalore-India/Data-Management---Business-Analyst_R-767482-1?source=APPLICANT_SOURCE-INDEED"
    },
    {
        "title": "Java Programmer",
        "company": "eSales Technologies",
        "location": "Puducherry",
        "salary": null,
        "description": "Designation: Senior Software Engineer\nLocation: Pondicherry\n\nSkill Set & Job Duties:\n\nExperience in Design pattern / Strong knowledge in OOPS\nServlets,Spring MVC,Spring Boot / Hibernate 4, JavaScript, Angular JS, Angular / HTML5, MySQL/\nMsSQL\nHands on in Preparing unit test cases\nExperience in Performing code review / Testing / Documentation\nGood communication and experience in handling client calls\nAbility to Work as team\nHands on experience in SDLC / Deployment in servers",
        "posted_date": "2025-02-12T05:56:37.000Z",
        "job_url": "https://www.esales.in/careers/"
    },
    {
        "title": "Python Django Developer (Mid-level)",
        "company": "Antino Labs",
        "location": "Gurugram, Haryana",
        "salary": null,
        "description": "Job Description:\n\nWe are seeking a talented Python Django Developer with a minimum of 2 years of experience to join our dynamic team. The ideal candidate should have a strong background in Python development and extensive experience working with the Django framework. You will be responsible for designing, developing, and implementing web applications using Django, as well as collaborating with cross-functional teams to deliver high-quality software solutions.\n\nResponsibilities:\n1.Design, develop, and maintain scalable web applications using Python and Django.\n2.Write clean, efficient, and reusable code following best practices and coding standards.\n3.Collaborate with front-end developers to integrate user-facing elements with server-side logic.\n4.Optimize applications for maximum speed and scalability.\n5.Debug and troubleshoot issues in existing applications.\n6.Participate in code reviews and provide constructive feedback to team members.\n7.Stay updated with the latest industry trends and technologies to continuously improve development processes.\n8.Mentor junior developers and guide them in their growth and development.\n9.Work closely with product managers and other stakeholders to understand requirements and deliver solutions on time.\n\nQualifications and Skills:\n\n1. Bachelor's or master's degree in computer science, Software Engineering, or a related field.\n2. 3+ years of experience in web development using Python and Django.\n3. Strong understanding of web technologies (HTML, CSS, JavaScript).\n4. Experience with RESTful API design and development.\n5. Familiarity with front-end frameworks (e.g., React, Angular) is a plus.\n6. Knowledge of database systems (e.g., PostgreSQL, MySQL) and ORM frameworks.\n7. Experience with version control systems (e.g., Git) and CI/CD pipelines.\n8. Strong problem-solving and analytical skills. Excellent communication and collaboration abilities.\n9. Proven track record of delivering high-quality projects on time",
        "posted_date": "2025-02-12T06:29:08.000Z",
        "job_url": "https://antino.freshteam.com/jobs/z_Pydt78BR5T/python-django-developer-mid-level"
    },
    {
        "title": "Software Engineer - III",
        "company": "Storable India (LinkedIn)",
        "location": "Hyderabad, Telangana",
        "salary": null,
        "description": "Job Title: Software Engineer III (.NET Developer)\n\nRole Overview:\nWe are looking for an experienced .NET Developer who will play a key role in designing, developing, and maintaining scalable applications using .NET Core, .NET Framework, and SQL Server. The ideal candidate will have a strong understanding of backend systems, database design, and modern development practices.\n\nResponsibilities:\n\nDesign, develop, test, and maintain applications using .NET Core and .NET Framework.\nWrite clean, efficient, and maintainable code to support business requirements.\nDevelop complex SQL queries, stored procedures, and optimize database performance on SQL Server.\nCollaborate with cross-functional teams to define, design, and ship new features.\nPerform code reviews, troubleshoot issues, and ensure application quality.\nSupport deployment processes and ensure smooth production releases.\nMaintain technical documentation for architecture, design, and implementation details.\n\nRequired Skills:\n\nStrong hands-on experience with .NET Core and .NET Framework.\nProficiency in SQL Server including query writing, stored procedures, and performance optimization.\nSolid understanding of C# and object-oriented programming concepts.\nExperience building RESTful APIs and integrating with third-party services.\nFamiliarity with version control tools like Git.\nStrong problem-solving, debugging, and analytical skills.\n\nPreferred Skills:\n\nExperience with cloud technologies (Azure, AWS) is a plus.\nKnowledge of front-end technologies like Angular/React is a bonus.\nExposure to Agile/Scrum methodologies.\n\nQualifications:\n\nBachelor's degree in Computer Science, Engineering, or related field.\n7+ years of experience in .NET development and SQL Server.\n\nAbout Us:\n\nAt Storable, we believe storage operators should have one partner they can trust to help you get the results they need for their business. That's why we've built the industry's first fully integrated platform that offers facility management software, facility websites, marketing programs and services, payments, and deeply integrated tenant insurance capabilities all in one solution.\n\nWe leverage our platform in combination with our over 25 years of storage industry expertise to help our thousands of storage customers achieve their tenant experience and operational efficiency objectives every single day.\n\nImportant Notice: Protect Yourself from Fraudulent Activities Targeting Job Seekers\n\nWe've been made aware of fraudulent activities where an individual or group is pretending to represent Storable, attempting to deceive job seekers by using our company's good name and stellar reputation.\n\nTo protect yourself, please consider the following guidelines:\n\n- Official Communication: All genuine communication from Storable will come from official email addresses, ending in \"@storable.com.\" Be cautious of any communication that doesn't match this criteria.\n- No Unsolicited Offers: We do not extend job offers without a formal interview process. If you receive an unsolicited job offer claiming to be from Storable or any of its representatives, it's a red flag.\n- Verification: If you're uncertain about the legitimacy of any job offer or communication claiming to be from Storable, please directly contact our HR department directly at POps@storable.com for verification.\n\nYour security and trust are paramount to us. If you suspect you've been contacted by someone falsely claiming to be from Storable or using our company's name for any dubious purpose, please immediately report the incident to POps@storable.com\n\nWe're committed to ensuring a transparent and secure hiring process.\n\nThank you for your vigilance and interest in joining our team.",
        "posted_date": "2025-02-12T06:34:36.000Z",
        "job_url": "https://job-boards.greenhouse.io/storableindia/jobs/5446909004?gh_src=fdc730314us"
    },
    {
        "title": "Business Intelligence Engineer , Amazon Last Mile",
        "company": "ADCI HYD 13 SEZ",
        "location": "Hyderabad, Telangana",
        "salary": null,
        "description": "- 2+ years of analyzing and interpreting data with Redshift, Oracle, NoSQL etc. experience\n- Experience with data visualization using Tableau, Quicksight, or similar tools\n- Experience with one or more industry analytics visualization tools (e.g. Excel, Tableau, QuickSight, MicroStrategy, PowerBI) and statistical methods (e.g. t-test, Chi-squared)\n- Experience with scripting language (e.g., Python, Java, or R)\n\nCome help Amazon create cutting-edge data and science-driven technologies for delivering packages to the doorstep of our customers! The Last Mile Routing & Planning organization builds the software, algorithms and tools that make the “magic” of home delivery happen: our flow, sort, dispatch and routing intelligence systems are responsible for the billions of daily decisions needed to plan and execute safe, efficient and frustration-free routes for drivers around the world. Our team supports deliveries (and pickups!) for Amazon Logistics, Prime Now, Amazon Flex, Amazon Fresh, Lockers, and other new initiatives.\n\nAs part of the Last Mile Science & Technology organization, you’ll partner closely with Product Managers, Data Scientists, and Software Engineers to drive improvements in Amazon's Last Mile delivery network. You will leverage data and analytics to generate insights that accelerate the scale, efficiency, and quality of the routes we build for our drivers through our end-to-end last mile planning systems. You will present your analyses, plans, and recommendations to senior leadership and connect new ideas to drive change. Analytical ingenuity and leadership, business acumen, effective communication capabilities, and the ability to work effectively with cross-functional teams in a fast paced environment are critical skills for this role.\n\nResponsibilities: \n · Create actionable business insights through analytical and statistical rigor to answer business questions, drive business decisions, and develop recommendations to improve operations \n · Collaborate with Product Managers, software engineering, data science, and data engineering partners to design and develop analytic capabilities \n · Define and govern key business metrics, build automated dashboards and analytic self-service capabilities, and engineer data-driven processes that drive business value \n Navigate ambiguity to develop analytic solutions and shape work for junior team members\n\n- Master's degree, or Advanced technical degree\n- Knowledge of data modeling and data pipeline design\n- Experience with statistical analysis, co-relation analysis\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
        "posted_date": "2025-02-12T07:53:44.000Z",
        "job_url": "https://www.amazon.jobs/en/jobs/2899163/business-intelligence-engineer-amazon-last-mile?cmpid=DA_INAD200785B"
    },
    {
        "title": "Full Stack (Angular + Java) Developer – Manager",
        "company": "PwC",
        "location": "Bengaluru, Karnataka",
        "salary": null,
        "description": "Line of Service\n\nAdvisory\n\nIndustry/Sector\n\nNot Applicable\n\nSpecialism\n\nSoftware Engineering\n\nManagement Level\n\nManager\n\nJob Description & Summary\n\nAt PwC, our people in software and product innovation focus on developing cutting-edge software solutions and driving product innovation to meet the evolving needs of clients. These individuals combine technical experience with creative thinking to deliver innovative software products and solutions.\n\nThose in software engineering at PwC will focus on developing innovative software solutions to drive digital transformation and enhance business performance. In this field, you will use your knowledge to design, code, and test cutting-edge applications that revolutionise industries and deliver exceptional user experiences.\n\nEnhancing your leadership style, you motivate, develop and inspire others to deliver quality. You are responsible for coaching, leveraging team member’s unique strengths, and managing performance to deliver on client expectations. With your growing knowledge of how business works, you play an important role in identifying opportunities that contribute to the success of our Firm. You are expected to lead with integrity and authenticity, articulating our purpose and values in a meaningful way. You embrace technology and innovation to enhance your delivery and encourage others to do the same.\n\nExamples of the skills, knowledge, and experiences you need to lead and deliver value at this level include but are not limited to:\n\nAnalyse and identify the linkages and interactions between the component parts of an entire system.\n\nTake ownership of projects, ensuring their successful planning, budgeting, execution, and completion.\n\nPartner with team leadership to ensure collective ownership of quality, timelines, and deliverables.\n\nDevelop skills outside your comfort zone, and encourage others to do the same.\n\nEffectively mentor others.\n\nUse the review of work as an opportunity to deepen the expertise of team members.\n\nAddress conflicts or issues, engaging in difficult conversations with clients, team members and other stakeholders, escalating where appropriate.\n\nUphold and reinforce professional and technical standards (e.g. refer to specific PwC tax and audit guidance), the Firm's code of conduct, and independence requirements.\n\nAngular\n* Deep proficiency in HTML,CSS,TypeScript and JavaScript.\n* Expert knowledge of Angular architecture, including advanced component communication and state management (e.g., NgRx).\n* Extensive experience with Angular CLI, with the ability to customize and optimize build configurations.\n* Advanced understanding of RxJS for complex reactive programming scenarios.\n* Experience with performance optimization techniques for large-scale Angular applications.\n* Proficiency in lazy loading modules and optimizing change detection strategies.\n* Expertise in setting up and maintaining comprehensive test suites using Jasmine, Karma.\n* Ability to implement and enforce code quality standards and best practices.\n* Strong experience with responsive design and accessibility standards.\n* Ability to design and implement custom UI components using Angular Material or other libraries.\nJava\n* Strong knowledge of Java concurrency, collections, and design patterns.\n* Extensive experience with Spring Framework, especially Spring Boot, Spring Security, and Spring Cloud for developing microservices.\n* Ability to design and implement scalable, secure, and high-performance RESTful APIs.\n* Proficiency in advanced testing techniques and frameworks, including BDD/TDD with JUnit, TestNG, and Mockito.\nCloud(AWS/Azure)\n* Understanding of cloud computing concepts, benefits, and deployment models.\n* Experience with core AWS services such as EC2, S3,IAM.\n* Strong understanding of cloud security best practices, including identity and access management, encryption, and network security.\n* Understanding of monitoring, logging, and alerting for cloud applications using AWS CloudWatch, Azure Monitor, or third-party tools.\n* Experience with containerization technologies like Docker and orchestration with Kubernetes.\n* Knowledge of CI/CD pipelines, including experience with Jenkins, Azure DevOps, or AWS CodePipeline.\n* Basic understanding of Infrastructure as a code, Terraform scripts.\nTeam Leadership:\n* Ability to guide teams through code reviews, technical decisions, and best practices.\n* Strong skills in project planning, cost estimation, and stakeholder communication.\n* Experience driving large-scale software delivery with Agile or Scrum methodologies.\nGeneral\n* Experience with Git for version control.\n* Ability to lead technical teams, mentor junior developers, and drive technical discussions and decisions.\n* Experience in designing and implementing architectural solutions that align with business goals and technical requirements.\n* Strong skills in stakeholder management and effective communication across technical and non-technical teams.\n* Commitment to continuous learning and staying updated with industry trends, tools, and technologies.\n* Ability to introduce and advocate for new technologies and processes that improve team efficiency and product quality.\n\nEducation (if blank, degree and/or field of study not specified)\n\nDegrees/Field of Study required:\n\nDegrees/Field of Study preferred:\n\nCertifications (if blank, certifications not specified)\n\nRequired Skills\n\nOptional Skills\n\nAcceptance Test Driven Development (ATDD), Acceptance Test Driven Development (ATDD), Accepting Feedback, Active Listening, Analytical Thinking, API Management, Application Development, Application Frameworks, Application Lifecycle Management, Application Software, Business Process Improvement, Business Process Management (BPM), Business Requirements Analysis, C++ Programming Language, Client Management, Coaching and Feedback, Code Review, Coding Standards, Communication, Computer Engineering, Computer Science, Continuous Integration/Continuous Delivery (CI/CD), Creativity, Debugging, Embracing Change {+ 35 more}\n\nDesired Languages (If blank, desired languages not specified)\n\nTravel Requirements\n\n0%\n\nAvailable for Work Visa Sponsorship?\n\nNo\n\nGovernment Clearance Required?\n\nNo\n\nJob Posting End Date\n\nFebruary 28, 2025",
        "posted_date": "2025-02-12T07:10:47.000Z",
        "job_url": "https://pwc.wd3.myworkdayjobs.com/en-US/Global_Experienced_Careers/job/Bangalore/Full-Stack--Angular---Java--Developer---Manager_602015WD-15"
    },
    {
        "title": "Senior Software Engineer",
        "company": "Cloudesign Technology Solutions",
        "location": "India",
        "salary": null,
        "description": "Job Title: Java Developer\n\nLocation: Bangalore\n\nExperience: Minimum 3 years\n\nJob Summary:\n\nWe are looking for a skilled Java Developer with a minimum of 3 years of experience to join our dynamic team in Bangalore. The ideal candidate will have a solid background in Java 8 or later, Spring Boot, Microservices architecture, and SQL. You will be responsible for developing, maintaining, and optimizing scalable applications while ensuring high performance and reliability.\n\nKey Responsibilities:\n\nDesign, develop, and maintain Java-based applications using Java 8+ and Spring Boot.\nBuild and maintain microservices-based architectures for scalable applications.\nWrite efficient and optimized SQL queries for database management.\nCollaborate with cross-functional teams to define, design, and ship new features.\nImplement best coding practices to ensure maintainability and scalability.\nTroubleshoot and resolve technical issues in development and production environments.\nConduct code reviews and contribute to continuous improvement of the development process.\n\nRequired Skills & Qualifications:\n\nMinimum 3 years of experience with Java 8+ and object-oriented programming.\nHands-on experience with Spring Boot and microservices architecture.\nProficiency in SQL and database management (MySQL, PostgreSQL, or similar).\nFamiliarity with RESTful APIs and web services.\nExperience with version control systems such as Git.\nStrong problem-solving and debugging skills.\nExcellent communication and teamwork abilities.\n\nPreferred Qualifications:\n\nExperience with cloud platforms (AWS, Azure, or GCP).\nKnowledge of CI/CD pipelines and DevOps practices.\nFamiliarity with containerization tools like Docker and Kubernetes.\n\nIf you are passionate about building scalable applications and enjoy working in a collaborative environment, we would love to hear from you!",
        "posted_date": "2025-02-12T08:13:07.000Z",
        "job_url": "https://cloudesign.keka.com/careers/jobdetails/77409"
    },
    {
        "title": "Business Analyst, Automation, Reporting and Tech sciences (ARTS)",
        "company": "ADCI - BLR 14 SEZ",
        "location": "Chennai, Tamil Nadu",
        "salary": null,
        "description": "- 3+ years of Excel or Tableau (data manipulation, macros, charts and pivot tables) experience\n- Experience defining requirements and using data and metrics to draw business insights\n- Experience with SQL or ETL\n- Knowledge of data visualization tools such as Quick Sight, Tableau, Power BI or other BI packages\n- 1+ years of tax, finance or a related analytical field experience\n\nAre you passionate about solving business challenges at a global scale? Amazon Employee Services is looking for an experienced Business Analyst to join Retail Business Services team and help unlock insights which take our business to the next level. The candidate will be excited about understanding and implementing new and repeatable processes to improve our employee global work authorization experiences. They will do this by partnering with key stakeholders to be curious and comfortable digging deep into the business challenges to understand and identify insights that will enable us to figure out standards to improve our ability to globally scale this program. They will be comfortable delivering/presenting these recommended solutions by retrieving and integrating artifacts in a format that is immediately useful to improve the business decision-making process. This role requires an individual with excellent analytical abilities as well as an outstanding business acumen. The candidate knows and values our customers (internal and external) and will work back from the customer to create structured processes for global expansions of work authorization, and help integrate new countries/new acquisitions into the existing program. They are experts in partnering and earning trust with operations/business leaders to drive these key business decisions.\nResponsibilities:\n\n- Own the development and maintenance of new and existing artifacts focused on analysis of requirements, metrics, and reporting dashboards.\n\n- Partner with operations/business teams to consult, develop and implement KPI’s, automated reporting/process solutions, and process improvements to meet business needs.\n\n- Enable effective decision making by retrieving and aggregating data from multiple sources and compiling it into a digestible and actionable format.\n\n- Prepare and deliver business requirements reviews to the senior management team regarding progress and roadblocks.\n\n- Participate in strategic and tactical planning discussions.\n\n- Design, develop and maintain scaled, automated, user-friendly systems, reports, dashboards, etc. that will support our business needs.\n\n- Excellent writing skills, to create artifacts easily digestible by business and tech partners.\n\nKey job responsibilities\n• Design and develop highly available dashboards and metrics using SQL and Excel/Tableau/QuickSight\n\n• Understand the requirements of stakeholders and map them with the data sources/data warehouse\n\n• Own the delivery and backup of periodic metrics, dashboards to the leadership team\n\n• Draw inferences and conclusions, and create dashboards and visualizations of processed data, identify trends, anomalies\n\n• Execute high priority (i.e. cross functional, high impact) projects to improve operations performance with the help of Operations Analytics managers\n\n• Perform business analysis and data queries using appropriate tools\n\n• Work closely with internal stakeholders such as business teams, engineering teams, and partner teams and align them with respect to your focus area\n\n- Experience in Amazon Redshift and other AWS technologies\n- Experience creating complex SQL queries joining multiple datasets, ETL DW concepts\n- Experience in SCALA and Pyspark\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
        "posted_date": "2025-02-12T07:53:35.000Z",
        "job_url": "https://www.amazon.jobs/en/jobs/2892800/business-analyst-automation-reporting-and-tech-sciences-arts?cmpid=DA_INAD200785B"
    },
    {
        "title": "Project Engineer",
        "company": "Rockwell Automation",
        "location": "Pune, Maharashtra",
        "salary": null,
        "description": "Rockwell Automation is a global technology leader focused on helping the world’s manufacturers be more productive, sustainable, and agile. With more than 28,000 employees who make the world better every day, we know we have something special. Behind our customers - amazing companies that help feed the world, provide life-saving medicine on a global scale, and focus on clean water and green mobility - our people are energized problem solvers that take pride in how the work we do changes the world for the better.\n\nWe welcome all makers, forward thinkers, and problem solvers who are looking for a place to do their best work. And if that’s you we would love to have you join us!\n\nJob Description\n\nDesigns, defines, and implements complex system requirements for customers and/or prepares studies and analyzes existing systems. Determines system specifications, input/output processes and working parameters for hardware/software compatibility. Coordinates design of subsystems and integration of total system. Identifies, analyzes, and resolves program support deficiencies. Develops and recommends corrective actions. Develops technical solutions and management processes by means of implementing systems or enterprise-wide solutions, using the company’s or a third-party’s hardware/software product. Develops and recommends solutions and strategies, based on the analysis of customer business goals, objectives, needs, and existing systems infrastructure. Participates in sales and proposal presentations in addition to completing ongoing team account activities.\n\nRockwell Automation’s hybrid policy aligns that employees are expected to work at a Rockwell location at least Mondays, Tuesdays, and Thursdays unless they have a business obligation out of the office.",
        "posted_date": "2025-02-12T03:43:40.000Z",
        "job_url": "https://rockwellautomation.wd1.myworkdayjobs.com/en-US/External_Rockwell_Automation/job/Pune-India/Project-Engineer_R24-7669?codes=IND"
    }
]